; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 553755 2 2 3 6 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	infrared0 - mode
	spectrograph1 - mode
	thermograph2 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation1 - direction
	Star5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph2)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
)
(:goal (and
	(pointing satellite1 Star9)
	(have_image Phenomenon6 infrared0)
	(have_image Planet7 infrared0)
	(have_image Star8 spectrograph1)
	(have_image Star9 spectrograph1)
	(have_image Star10 spectrograph1)
	(have_image Phenomenon11 spectrograph1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
2. (turn_to satellite1 star9 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star9)
   goals met: 1 of 7
3. (turn_to satellite0 star9 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star9)
   goals met: 1 of 7
4. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 7
5. (turn_to satellite0 groundstation1 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation1)
   goals met: 1 of 7
6. (turn_to satellite1 star10 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star10)
   goals met: 0 of 7
7. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 7
8. (turn_to satellite1 star9 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star9)
   goals met: 1 of 7
9. (turn_to satellite0 star8 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star8)
   goals met: 1 of 7
10. (turn_to satellite1 planet7 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 planet7)
   goals met: 0 of 7
11. (take_image satellite0 star8 instrument0 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 1 of 7
12. (turn_to satellite1 star9 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star9)
   goals met: 2 of 7
13. (turn_to satellite0 star10 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star10)
   goals met: 2 of 7
14. (turn_to satellite1 phenomenon6 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 phenomenon6)
   goals met: 1 of 7
15. (take_image satellite0 star10 instrument0 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 2 of 7
16. (turn_to satellite1 star9 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 star9)
   goals met: 3 of 7
17. (turn_to satellite0 planet7 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet7)
   goals met: 3 of 7
18. (turn_to satellite1 phenomenon11 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 phenomenon11)
   goals met: 2 of 7
19. (take_image satellite0 planet7 instrument0 infrared0)
   added: (have_image planet7 infrared0)
   goals met: 3 of 7
20. (turn_to satellite1 star9 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 star9)
   goals met: 4 of 7
21. (turn_to satellite1 groundstation1 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 groundstation1)
   goals met: 3 of 7
22. (turn_to satellite0 phenomenon6 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 phenomenon6)
   goals met: 3 of 7
23. (take_image satellite0 phenomenon6 instrument0 infrared0)
   added: (have_image phenomenon6 infrared0)
   goals met: 4 of 7
24. (calibrate satellite1 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 4 of 7
25. (turn_to satellite0 star9 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star9)
   goals met: 4 of 7
26. (turn_to satellite1 star9 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star9)
   goals met: 5 of 7
27. (take_image satellite0 star9 instrument0 spectrograph1)
   added: (have_image star9 spectrograph1)
   goals met: 6 of 7
28. (turn_to satellite1 phenomenon11 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 phenomenon11)
   goals met: 5 of 7
29. (turn_to satellite0 phenomenon11 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 phenomenon11)
   goals met: 5 of 7
30. (take_image satellite1 phenomenon11 instrument1 spectrograph1)
   added: (have_image phenomenon11 spectrograph1)
   goals met: 6 of 7
31. (turn_to satellite1 star9 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 star9)
   goals met: 7 of 7
